{
  "backend/main.mo": "Main backend canister managing articles, user profiles, newsletter subscriptions, and access‑controlled queries with seeded demo content.",
  "backend/migration.mo": "Migration module upgrading stored data to include access control state and user profiles while preserving existing article and newsletter maps.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to file paths, components, and test IDs with confidence scores.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all major frontend components and pages.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styles for the app.",
  "frontend/index.html": "HTML entry point loading the root React app and main script.",
  "frontend/src/App.tsx": "Top‑level React app configuring routing, theme provider, direct auth provider, and global toaster.",
  "frontend/src/components/articles/ArticleCard.tsx": "Card component rendering article image, metadata, summary, and a read‑more button.",
  "frontend/src/components/auth/AuthCard.tsx": "Simple wrapper card component used for authentication UI.",
  "frontend/src/components/auth/AuthModal.tsx": "Modal providing login and signup forms with mode switching.",
  "frontend/src/components/auth/LoginForm.tsx": "Login form that submits email/password to the direct auth context with validation and navigation on success.",
  "frontend/src/components/auth/RequireAnonymous.tsx": "Conditional wrapper that renders children only when the user is not authenticated.",
  "frontend/src/components/auth/SignupForm.tsx": "Signup form handling user input, validation, and account creation before redirecting home.",
  "frontend/src/components/home/CategoriesSection.tsx": "Displays article categories as tabs and loads top articles per category.",
  "frontend/src/components/home/HeroSection.tsx": "Hero banner with CTAs that open auth modal or navigate based on authentication.",
  "frontend/src/components/home/InlineSignupSection.tsx": "Inline signup card for new users with validation and redirect after successful signup.",
  "frontend/src/components/home/TopStoriesSection.tsx": "Fetches and displays latest top stories with skeleton loading states.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with links, contact info, social icons, and attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive site header with navigation, auth controls, and mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapping content with header and footer.",
  "frontend/src/components/navigation/NavLink.tsx": "Custom navigation link with active state styling.",
  "frontend/src/components/news/FeaturedNewsSection.tsx": "Loads and displays the main featured news article with image and metadata.",
  "frontend/src/components/news/NewsSidebar.tsx": "Sidebar showing signup prompt, popular articles, recent comments, and an auth modal for anonymous users.",
  "frontend/src/components/news/PaginatedNewsList.tsx": "Displays articles with pagination, fetching pages via a query and showing skeletons while loading.",
  "frontend/src/components/newsletter/NewsletterSignup.tsx": "Newsletter signup form with email validation, subscription mutation, and success/error toasts.",
  "frontend/src/contexts/DirectAuthContext.tsx": "Provides simple direct auth context with localStorage session restore and mock signup/login/logout.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches backend actors based on identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth client, identity loading, login flow, and context exposure.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching articles, paginated data, categories, and handling newsletter subscriptions.",
  "frontend/src/index.css": "Tailwind setup defining color tokens, dark mode values, fonts, and utility classes including gold accents.",
  "frontend/src/lib/articles.ts": "Helpers to format article dates and sort articles by creation time.",
  "frontend/src/lib/auth.ts": "Utility functions for formatting principals, checking authentication, and deriving display names.",
  "frontend/src/lib/pagination.ts": "Simple helpers to compute pagination offsets and total pages.",
  "frontend/src/lib/sessionFlags.ts": "SessionStorage helpers for tracking whether the auth modal has been shown.",
  "frontend/src/lib/validation.ts": "Validates email format using a basic regex.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider, rendering the App component.",
  "frontend/src/pages/AboutPage.tsx": "Displays the About page with mission, vision, and team information inside styled card components.",
  "frontend/src/pages/AuthPage.tsx": "Provides a login/signup page that switches between LoginForm and SignupForm inside an AuthCard.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page composed of hero, signup, top stories, categories, and newsletter sections.",
  "frontend/src/pages/NewsPage.tsx": "Shows the Latest News page with a featured section, paginated list, and sidebar layout.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Contains the Privacy Policy content using card sections for cookies, data protection, and third‑party links.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, including hash-based parsing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and theme extensions.",
  "project_state.json": "Describes the project state, requirements, design specs, and existing features for the Daily News site."
}